In [1]:
import pandas as pd

In [2]:
from pandas import Series, DataFrame

In [5]:
obj = pd.Series([4, 7, -5, 3])

In [6]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [7]:
obj.values

array([ 4,  7, -5,  3])

In [8]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [9]:
obj2 = pd.Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])

In [10]:
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [11]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [12]:
obj2['a']

-5

In [14]:
obj2['d'] = 6

In [16]:
obj2[['c', 'a', 'd']]

c    3
a   -5
d    6
dtype: int64

In [17]:
obj2

d    6
b    7
a   -5
c    3
dtype: int64

In [18]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [19]:
obj2 * 2

d    12
b    14
a   -10
c     6
dtype: int64

In [28]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [22]:
import numpy as np

In [29]:
'b' in obj2

True

In [30]:
'e' in obj2

False

In [31]:
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}

In [32]:
obj3 = pd.Series(sdata)

In [33]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [36]:
states = ['California', 'Ohio', 'Oregon', Texas']

In [38]:
obj4 = pd.Series(sdata, index=states)

In [39]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [40]:
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [41]:
pd.notnull(obj4)

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [42]:
obj4.isnull()

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [43]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [44]:
obj3

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [45]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [46]:
obj3 + obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [47]:
obj4.name = 'population'

In [48]:
obj4.index.name = 'state'

In [49]:
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

In [50]:
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [51]:
obj.index = ['Bob' ,'Steve', 'Jeff', 'Ryan']

In [52]:
obj

Bob      4
Steve    7
Jeff    -5
Ryan     3
dtype: int64

In [54]:
data = {'state':['Ohio', 'Ohio', 'Ohio', 'Nevaa', 'Nevaa', 'Nevaa'],
            'year': [2000, 2001, 2002, 2001, 2002, 2003],
            'pop': [1.5,1.7,3.6,2.4,2.9,3.2]}
frame = pd.DataFrame(data)

In [55]:
frame

   state  year  pop
0   Ohio  2000  1.5
1   Ohio  2001  1.7
2   Ohio  2002  3.6
3  Nevaa  2001  2.4
4  Nevaa  2002  2.9
5  Nevaa  2003  3.2

In [56]:
frame.head()

   state  year  pop
0   Ohio  2000  1.5
1   Ohio  2001  1.7
2   Ohio  2002  3.6
3  Nevaa  2001  2.4
4  Nevaa  2002  2.9

In [57]:
pd.DataFrame(data, columns =['year', 'state', 'pop'])

   year  state  pop
0  2000   Ohio  1.5
1  2001   Ohio  1.7
2  2002   Ohio  3.6
3  2001  Nevaa  2.4
4  2002  Nevaa  2.9
5  2003  Nevaa  3.2

In [58]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'],
                     index=['one', 'two', 'three', 'four', 'five', 'six'])

In [59]:
frame2

       year  state  pop debt
one    2000   Ohio  1.5  NaN
two    2001   Ohio  1.7  NaN
three  2002   Ohio  3.6  NaN
four   2001  Nevaa  2.4  NaN
five   2002  Nevaa  2.9  NaN
six    2003  Nevaa  3.2  NaN

In [61]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [62]:
frame2['state']

one       Ohio
two       Ohio
three     Ohio
four     Nevaa
five     Nevaa
six      Nevaa
Name: state, dtype: object

In [63]:
frame2.year

one      2000
two      2001
three    2002
four     2001
five     2002
six      2003
Name: year, dtype: int64

In [64]:
frame2.state

one       Ohio
two       Ohio
three     Ohio
four     Nevaa
five     Nevaa
six      Nevaa
Name: state, dtype: object

In [65]:
frame2.loc['three']

year     2002
state    Ohio
pop       3.6
debt      NaN
Name: three, dtype: object

In [74]:
frame2['debt'] = 16.5

In [75]:
frame2

       year  state  pop  debt  dedt
one    2000   Ohio  1.5  16.5   0.0
two    2001   Ohio  1.7  16.5   1.0
three  2002   Ohio  3.6  16.5   2.0
four   2001  Nevaa  2.4  16.5   3.0
five   2002  Nevaa  2.9  16.5   4.0
six    2003  Nevaa  3.2  16.5   5.0

In [76]:
frame2['debt'] = np.arange(6.)

In [77]:
frame2

       year  state  pop  debt  dedt
one    2000   Ohio  1.5   0.0   0.0
two    2001   Ohio  1.7   1.0   1.0
three  2002   Ohio  3.6   2.0   2.0
four   2001  Nevaa  2.4   3.0   3.0
five   2002  Nevaa  2.9   4.0   4.0
six    2003  Nevaa  3.2   5.0   5.0

In [78]:
val = pd.Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])

In [79]:
frame2['debt'] = val

In [80]:
frame2

       year  state  pop  debt  dedt
one    2000   Ohio  1.5   NaN   0.0
two    2001   Ohio  1.7  -1.2   1.0
three  2002   Ohio  3.6   NaN   2.0
four   2001  Nevaa  2.4  -1.5   3.0
five   2002  Nevaa  2.9  -1.7   4.0
six    2003  Nevaa  3.2   NaN   5.0

In [81]:
frame2['eastern'] = frame2.state == 'Ohio'

In [82]:
frame2

       year  state  pop  debt  dedt  eastern
one    2000   Ohio  1.5   NaN   0.0     True
two    2001   Ohio  1.7  -1.2   1.0     True
three  2002   Ohio  3.6   NaN   2.0     True
four   2001  Nevaa  2.4  -1.5   3.0    False
five   2002  Nevaa  2.9  -1.7   4.0    False
six    2003  Nevaa  3.2   NaN   5.0    False

In [84]:
del frame2['eastern']

In [85]:
frame2.columns

Index(['year', 'state', 'pop', 'debt', 'dedt'], dtype='object')

In [86]:
del frame2['dedt']

In [87]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [98]:
pop = {'Nevada': {2001: 2.4, 2002: 2.9},
              'Ohio': {2000: 1.5, 2001: 1.7, 2002: 3.6}}

In [99]:
frame3 = pd.DataFrame(pop)

In [100]:
frame3

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2000     NaN   1.5

In [93]:
frame3.T

        2001  2002  2000
Nevada   2.4   2.9   NaN
Ohio     1.7   3.6   1.5

In [94]:
pd.DataFrame(pop, index=[2001, 2002, 2003])

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [117]:
pdata = {'Ohio': frame3['Ohio'],
        'Nevada': frame3['Nevada'][:2]}

In [118]:
pd.DataFrame(pdata)

      Ohio  Nevada
2000   1.5     NaN
2001   1.7     2.4
2002   3.6     2.9

In [119]:
frame3.index.name = 'year'; frame3.columns.name = 'state'

In [120]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [121]:
frame3.values

array([[2.4, 1.7],
       [2.9, 3.6],
       [nan, 1.5]])

In [122]:
frame2.values

array([[2000, 'Ohio', 1.5, nan],
       [2001, 'Ohio', 1.7, -1.2],
       [2002, 'Ohio', 3.6, nan],
       [2001, 'Nevaa', 2.4, -1.5],
       [2002, 'Nevaa', 2.9, -1.7],
       [2003, 'Nevaa', 3.2, nan]], dtype=object)

In [126]:
obj = pd.Series(range(3), index=['a', 'b', 'c'])

In [127]:
index = obj.index

In [128]:
index

Index(['a', 'b', 'c'], dtype='object')

In [129]:
index[1:]

Index(['b', 'c'], dtype='object')

In [130]:
labels = pd.Index(np.arange(3))

In [131]:
labels

Int64Index([0, 1, 2], dtype='int64')

In [132]:
obj2 = pd.Series([1.5, -2.5, 0], index=labels)

In [133]:
obj2

0    1.5
1   -2.5
2    0.0
dtype: float64

In [134]:
obj2.index is labels

True

In [135]:
frame3

state  Nevada  Ohio
year
2001      2.4   1.7
2002      2.9   3.6
2000      NaN   1.5

In [136]:
frame3.columns

Index(['Nevada', 'Ohio'], dtype='object', name='state')

In [137]:
'Ohio' in frame3.columns

True

In [138]:
2003 in frame3.columns

False

In [141]:
dub_labels = pd.Index(['foo', 'foo', 'bar', 'bar' ])

In [142]:
dub_labels

Index(['foo', 'foo', 'bar', 'bar'], dtype='object')

In [145]:
obj = pd.Series([4.5, 7.2, -5.3, 3.6], index=['d', 'b', 'a', 'c'])

In [146]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [147]:
obj2 = obj.reindex(['a','b','c','d','e'])

In [148]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [149]:
obj3 = pd.Series(['blue','puple','yellow'], index=[0, 2, 4])

In [150]:
obj3

0      blue
2     puple
4    yellow
dtype: object

In [151]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2     puple
3     puple
4    yellow
5    yellow
dtype: object

In [152]:
frame = pd.DataFrame(np.arange(9).reshape((3, 3)),
                    index=['a', 'c', 'd'],
                    columns=['Ohio', 'Texas', 'California'])

In [153]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [154]:
frame2 = frame.reindex(['a','b','c','d'])

In [155]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [156]:
states = ['Texas', 'Utah', 'California']

In [157]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [158]:
frame.loc[['a','b','c','d'], states]

/Library/Frameworks/Python.framework/Versions/3.7/lib/python3.7/site-packages/pandas/core/indexing.py:1418: FutureWarning:
Passing list-likes to .loc or [] with any missing label will raise
KeyError in the future, you can use .reindex() as an alternative.

See the documentation here:
https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike
  return self._getitem_tuple(key)

   Texas  Utah  California
a    1.0   NaN         2.0
b    NaN   NaN         NaN
c    4.0   NaN         5.0
d    7.0   NaN         8.0

In [159]:
obj = pd.Series(np.arange(5.), index=['a', 'b', 'c', 'd', 'e'])

In [160]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [161]:
new_obj = obj.drop('c')

In [162]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [163]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [164]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [165]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [166]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [167]:
data.drop(['Colorado', 'Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [168]:
data.drop('two', axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [169]:
data.drop(['two', 'four'], axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [170]:
obj.drop('c', inplace=True)

In [171]:
obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [172]:
obj = pd.Series(np.arange(4.), index=['a','b','c','d'])

In [173]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [174]:
obj['b']

1.0

In [175]:
obj[1]

1.0

In [176]:
obj[2:4]

c    2.0
d    3.0
dtype: float64

In [177]:
obj[['b', 'a', 'd']]

b    1.0
a    0.0
d    3.0
dtype: float64

In [178]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [179]:
obj[obj < 2]

a    0.0
b    1.0
dtype: float64

In [180]:
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [181]:
obj['b':'c']=5

In [182]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [183]:
data = pd.DataFrame(np.arange(16).reshape((4, 4)),
                   index=['Ohio', 'Colorado', 'Utah', 'New York'],
                   columns=['one', 'two', 'three', 'four'])

In [184]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [185]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int64

In [187]:
data[['three', 'one']]

          three  one
Ohio          2    0
Colorado      6    4
Utah         10    8
New York     14   12

In [188]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [189]:
data[data['three'] > 5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [190]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [191]:
data[data < 5] = 0

In [193]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [194]:
data.loc['Colorado', ['two', 'three']]

two      5
three    6
Name: Colorado, dtype: int64

In [195]:
data.iloc[2,[3, 0, 1]]

four    11
one      8
two      9
Name: Utah, dtype: int64

In [196]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int64

In [197]:
data.iloc[[1, 2], [3, 0, 1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [198]:
data.loc[:'Utah', 'two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int64

In [199]:
data.iloc[:, :3][data.three > 5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14

In [200]:
ser = pd.Series(np.arange(3.))
ser
ser[-1]

KeyError: -1

In [201]:
ser

0    0.0
1    1.0
2    2.0
dtype: float64

In [202]:
ser2 = pd.Series(np.arange(3.), index=['a', 'b', 'c'])

In [203]:
ser2[-1]

2.0

In [204]:
ser[:1]

0    0.0
dtype: float64

In [206]:
ser.loc[:1]

0    0.0
1    1.0
dtype: float64

In [207]:
ser.iloc[:1]

0    0.0
dtype: float64

In [208]:
s1 = pd.Series([7.3, -2.5, 3.4, 3.1], index=['a',  'c', 'd', 'e'])

In [209]:
s2 = pd.Series([-2.1, 3.6, -1.5, 4, 3.1], index=['a', 'c', 'e', 'f','g'])

In [210]:
s1

a    7.3
c   -2.5
d    3.4
e    3.1
dtype: float64

In [211]:
s2

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [212]:
s1+s2

a    5.2
c    1.1
d    NaN
e    1.6
f    NaN
g    NaN
dtype: float64

In [213]:
df1 = pd.DataFrame(np.arange(9.).reshape((3, 3)), columns=list('bcd'),
                  index=['Ohio', 'Texas', 'Colorado'])

In [217]:
df2 = pd.DataFrame(np.arange(12.).reshape((4, 3)), columns=list('bde'),
                  index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [215]:
df1

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

In [218]:
df2

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [219]:
df1+df2

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

In [232]:
df1 = pd.DataFrame({'A': [1,2]})

In [233]:
df2 = pd.DataFrame({'B': [3,4]})

#

In [234]:
df1

   A
0  1
1  2

In [235]:
df2

   B
0  3
1  4

In [236]:
df1 - df2

    A   B
0 NaN NaN
1 NaN NaN

In [237]:
df1 = pd.DataFrame(np.arange(12.).reshape((3, 4)), columns=list('abcd'))

In [239]:
df2 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list('abcde'))

In [240]:
df2.loc[1, 'b'] = np.nan

In [241]:
df1

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

In [242]:
df2

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   NaN   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [243]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0   NaN  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [245]:
df1.add(df2,fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0   5.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [246]:
1/ df1

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [247]:
df1.rdiv(1)

       a         b         c         d
0    inf  1.000000  0.500000  0.333333
1  0.250  0.200000  0.166667  0.142857
2  0.125  0.111111  0.100000  0.090909

In [248]:
df1.reindex(columns=df2.columns, fill_value=0)

     a    b     c     d  e
0  0.0  1.0   2.0   3.0  0
1  4.0  5.0   6.0   7.0  0
2  8.0  9.0  10.0  11.0  0

In [249]:
arr = np.arange(12.).reshape((3, 4))

In [250]:
arr

array([[ 0.,  1.,  2.,  3.],
       [ 4.,  5.,  6.,  7.],
       [ 8.,  9., 10., 11.]])

In [251]:
arr[0]

array([0., 1., 2., 3.])

In [252]:
arr - arr[0]

array([[0., 0., 0., 0.],
       [4., 4., 4., 4.],
       [8., 8., 8., 8.]])

In [254]:
frame = pd.DataFrame(np.arange(12.).reshape((4, 3)),
                    columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [255]:
series = frame.iloc[0]

In [256]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [257]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [258]:
frame - series

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [259]:
series2 = pd.Series(range(3), index=['b', 'e', 'f'])

In [260]:
frame + series2

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [261]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [262]:
series2

b    0
e    1
f    2
dtype: int64

In [264]:
series3 = frame['d']

In [265]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [266]:
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [267]:
frame.sub(series3, axis='index')

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [268]:
frame = pd.DataFrame(np.random.randn(4, 3), columns=list('bde'),
                    index=['Utah', 'Ohio', 'Texas', 'Oregon'])

In [269]:
frame

               b         d         e
Utah    1.827446 -0.545371  0.035688
Ohio    1.434658 -2.191657 -0.761131
Texas   2.789393  0.218602  2.835623
Oregon -0.472330  0.376495  1.793455

In [270]:
np.abs(frame)

               b         d         e
Utah    1.827446  0.545371  0.035688
Ohio    1.434658  2.191657  0.761131
Texas   2.789393  0.218602  2.835623
Oregon  0.472330  0.376495  1.793455

In [271]:
f = lambda x: x.max() - x.min()

In [272]:
frame.apply(f)

b    3.261723
d    2.568152
e    3.596754
dtype: float64

In [273]:
frame.apply(f, axis='columns')

Utah      2.372817
Ohio      3.626315
Texas     2.617020
Oregon    2.265785
dtype: float64

In [278]:
def f(x):
    return pd.Series([x.min(), x.max()], index=['min',' max'])

In [279]:
frame.apply(f)

             b         d         e
min  -0.472330 -2.191657 -0.761131
 max  2.789393  0.376495  2.835623

In [280]:
format = lambda x: '%.2f' % x

In [281]:
frame.applymap(format)

            b      d      e
Utah     1.83  -0.55   0.04
Ohio     1.43  -2.19  -0.76
Texas    2.79   0.22   2.84
Oregon  -0.47   0.38   1.79

In [282]:
frame['e'].map(format)

Utah       0.04
Ohio      -0.76
Texas      2.84
Oregon     1.79
Name: e, dtype: object

In [283]:
obj = pd.Series(range(4), index=['d', 'a', 'b', 'c'])

In [284]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int64

In [286]:
frame = DataFrame(np.arange(8).reshape((2, 4)),
                 index=['three', 'one'],
                  columns=['d', 'a', 'b', 'c'])

In [287]:
frame.sort_index()

       d  a  b  c
one    4  5  6  7
three  0  1  2  3

In [288]:
frame.sort_index(axis=1)

       a  b  c  d
three  1  2  3  0
one    5  6  7  4

In [289]:
frame.sort_index(axis=1, ascending=False)

       d  c  b  a
three  0  3  2  1
one    4  7  6  5

In [294]:
obj = pd.Series([4, 7, -3, 2])

In [295]:
obj.sort_values()

2   -3
3    2
0    4
1    7
dtype: int64

In [296]:
obj = pd.Series([4, np.nan, 7, np.nan, -3.2])